*** RESULTS:
: Hello, John! 
: undefined

- Note, class fields only apply to teh individual objects, not =User.prototype=

#+BEGIN_SRC js
  class User{
      name = "John";
  }
  let user = new User();
  console.log(user.name);
  console.log(User.prototype.name);
#+END_SRC

#+RESULTS:
: John
: undefined
: undefined

